[
    {
        "department":"Chemical Engineering",
        "aboutDepartment":"Department of Chemical Engineering, TSEC was established in 1983. It has a long and distinguished history of successfully educating leaders for a wide variety of industries. Ever since its inception in 1983, the Institute has established itself as a premier institution engaged in imparting quality technological education. The Department of Chemical Engineering, TSEC is NBA accredited for three years (2019-2022).",
        "vision":"To be a learning organization to provide total solution for sustainable industrial business in the realm of chemical engineering process, bio-technology, material technology, energy and environment by leveraging evolving information communication technology.",
        "mission":"Radically modify the curriculum design process to be abreast with new changes in the core and auxiliary enabling technology.|Create world class experimental facilities for carrying investigation and research in biotechnology.|Create center of Excellency in environmental studies and research.Train students about ethical and societal impact of their professional activities.|Create world class laboratories to further the cause of material technology.|Initiate startup in space based energy generation and related research.|Initiate students to entrepreneur training, industrial finance and risk management.|Constitute a chair to promote the necessity and virtue of sustainable development model for industrial activity."
    },
    {
        "department":"Computer Engineering",
        "aboutDepartment":"The computer engineering department of Thadomal Shahani Engineering College was established in the year 1984 and has grown over the years into a competent department with state of the art computing facilities and a dedicated faculty. The goal of the department is to establish state of the art computing environment to develop competent computer engineers imbibed with the spirit of professionalism and responsible citizenship. The department emphasizes the vision of the Thadomal Shahani Engineering College for excellence in education. Highly qualified, dedicated faculty and good infrastructure facilities make this dream realizable.",
        "vision":"Metamorphosis into a center of excellence in higher education and enterprise computing to nurture and facilitate the learners who ought to be the creams of society in terms of their irresistible ambition to be part of entities inventing breakthrough technologies to further the cause of mankind through emerging technologies.",
        "mission":"Building state of art laboratories with the help of internal accruals / government funding / industry funding.|Collaborative research initiative with premier research organizations in the country.|Subjecting and initiating learners to entrepreneurship training program and nascent technologies which shall be beyond curriculum.|Developing instructional content leveraging new findings of cognitive load theories and visual learning.|Initiating public-private partnership to setup startup ventures to help learners evolve as entrepreneurs in ICT.|Extensively promote participation in application building competition organized externally and internally to enable learner to apply theoretical understanding in real time functional area."
    },
    {
        "department":"EXTC",
        "aboutDepartment":"Department of Electronics and Telecommunication was established in year 2002 with a clear view of a forerunner in the field of Telecommunications, the Department seeks to evolve towards excellence and adapt itself to the rapid advancements in specialized communication related fields. This Department earlier had nomenclature of Electronics Engineering from 1983 to 2001 with student intake of 120. From 2002 Student intake is 60.  At the desktop of achievements of the department, lies the award of accreditation given by the National Board of Accreditation during 2008 – 2011 and re accreditation from 2016 to 2019. The department has also started PhD. with an intake of 10 students from the academic year 2014-15.",
        "vision":"The department aims to provide a program of high quality to develop outstanding managers and technocrats who will make valuable contribution to the global business and society to suit their ever changing needs by fostering technology worldwide.",
        "mission":"To provide its students with knowledge required for high quality engineering process.|To equip its students with a broad intellectual spectrum in order to prepare them for diverse and competitive carrier paths.|To educate students to be professionally competent for industry and for academic and research programs.|To strive for excellence in faculty and students by encouraging skill development, creativity, capability and applicability.|To support the institute’s research activities and consultancy services by introducing the doctoral programs in future.|To strengthen the institute through network of alumni and maximize use of such resources.|To educate students with a broad and in-depth knowledge of Electronics and Telecommunication systems, and to develop leaders in this field."
    },
    {
        "department":"Information Technology",
        "aboutDepartment":"Department of Information Technology was established in year 1998 with a clear view of a forerunner in the field of Information Technology, the Department seeks to evolve towards excellence and adapt itself to the rapid advancements in specialized fields. The Departments first batch started with thirty (30) students and the intake from 2002 to till date is one hundred twenty (120) per batch. The campus placement is nearly 100% every year.",
        "vision":"The department should be known globally for its core competence in terms of intuitive and intelligent architectural solutions on “conversion of problem to logic”.",
        "mission":"Theoretical rigour to develop conceptual clarity.| Modelling and design of experiments to inculcate culture of investigation.|Making project based learning-learning as a pervasive pedagogy.|Transcending learning in the emerging areas of Artificial Intelligence, Deep Learning, Block-chain technology and Quantum Computing.|Short term training program in evolving fields of Information Technology.|Collaborative learning, interdisciplinary studies and exposure to functional areas.|Sensitising all concerned about automation in IT services, software product and software process innovation.|Introducing risk management, risk mitigation and the process of hedging.|Inculcating and enhancing the culture of entrepreneurship, start-up ventures and incubation process.|Metamorphosis from teaching paradigm to learning paradigm.|Every day discourse shall inculcate research culture and create IPR in terms of process and product patents, by understanding various markets and cultures.|Sensitising all stakeholders about the impending ecological disasters due to failure in adapting carbon neutral enterprise wide processes and procedures."
    },
    {
        "department":"First Year",
        "aboutDepartment":"Established in 1983, Thadomal Shahani Engineering College (TSEC), founded by Hyderabad (Sind) National Collegiate Board, is recognized by Government of Maharashtra, approved by All India Council for Technical Education (AICTE) and Affiliated to University of Mumbai. It offers a 4-year Bachelor of Engineering (B.E.) Degree program in Artificial Intelligence and data Science, Information Technology, Computer Engineering, Electronics & Telecommunication and Chemical Engineering. The College offers Ph.D. program in the subject of Information Technology, Computer Engineering, and Electronics & Telecommunication. At present we are enrolled with 40 research Scholars.\n\nTSEC is hugely successful in creating an academic ambience where learners increasingly succeed in unleashing their potential. The college hugely succeeds in placing graduating students in leading enterprises (more than 90 enterprises offer campus placement to our graduates) and facilitating them for higher studies in the Post Graduate program of choice, in India and abroad. The college historically performed to its fullest potential with best of class practises and emerged as the most sought-after engineering college in the city of Mumbai. It has emerged as a single point solution for the students and parents who are seeking professional education in the realm of engineering and our professionalism gets accentuated by enterprises in queue to roll out “offer appointments” to our graduating students.\n\nWe were keen on establishing quality systems and procedures in academic setting and eventually that led to accreditation of our programs by National Board of Accreditation in multiple cycles. We are having a system in place (Training and Placement Cell) to identify emerging / thrust areas in engineering and integrate in the course curriculum. We introduced courses like Artificial Intelligence, Machine Learning, Deep Learning and Blockchain Technology in tandem with the University to be abreast with nascent technologies. TSEC follows a gender agnostic and all-inclusive academic ambience and practises where pupils thrive and emerge as productive entities over a period of four years of engagement.",
        "vision":"Contributing to evolving supply chain of human capital for National Economy\nCreating entrepreneurs and ‘game changers’ to support heightened level of economic activities underpinning ever increasing human aspiration\nHelping the Nation evolve as a total solution provider\nValue and wealth creation for the mankind",
        "mission":"Product and processes innovation. | Leveraging human cognitive and behavioral science for creating instructional content. |Pervasive and ubiquitous Information Communication Technologies for customized content for learning. |Acknowledge and facilitate various learning styles and learning abilities. |Migrating from teaching paradigm to learning paradigm. |Every day discourse shall inculcate research culture and further the cause of societal advancement. |Understand various markets and cultures. |Collaborative learning and emotional integrity. |Sensitizing about opportunities in Energy, Education, Environment and Health care sectors. |Extensively promoting computer aided design,analysis and manufacturing procedures, |Theoretical rigor to develop conceptual clarity. |Modeling and design of experiments to inculcate culture of investigation. |Helping foot print on Project management and collaborative human endeavor. |Interdisciplinary studies and exposure to functional areas"
    },
    {
        "department":"AI & DS",
        "aboutDepartment":"The department of AI and DS was established in the year 2020 with highly qualified senior faculty with doctoral degree. This newly added department of TSEC has been set up with a goal of training students as leaders and researchers in the fields of Artificial Intelligence & Data Science with world class infrastructure, curriculum and comprehensive hands on experience through industry connect programs. Learners aspiring to get exposed to nascent technologies in the realm of computer and digital technology with an aptitude for tracking mathematical complexities shall aspire to join this 4 years degree program in AI and DS which is getting established in the current year. It is an excellent opportunity to satisfy intellectual ego in addition to massive market opportunities.",
        "vision":"To contribute to further the cause of the Nation, which is in the process of emerging as a total solution provider in the realm of Artificial Intelligence driven Business solutions.",
        "mission":"To help learners to develop competency in algorithmic approaches in resolving complexities of real time problems.|To initiate pupils to creative solution building processes based on intuitive / imaginative solution building processes.|To build digital learning content in the realm of AI & DS underpinning the theories of cognitive science.|To create a supply chain of human capital characterized by intellectual/ emotional and high degree of spiritual quotient.|To equip students with interdisciplinary skill sets to perform intelligent data analysis which in turn provides dynamic and promising careers in emerging technologies.|To create an academic environment for higher learning, lifelong learning, academic practices, and research endeavours."
    }
]